RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_enet_qos.h
/*! @brief Defines the status return codes for transaction. */
enum
{
    kStatus_ENET_QOS_InitMemoryFail =
        MAKE_STATUS(kStatusGroup_ENET_QOS, 0U), /*!< Init fails since buffer memory is not enough. */
    kStatus_ENET_QOS_RxFrameError =
        MAKE_STATUS(kStatusGroup_ENET_QOS, 1U), /*!< A frame received but data error happen. */
    kStatus_ENET_QOS_RxFrameFail  = MAKE_STATUS(kStatusGroup_ENET_QOS, 2U), /*!< Failed to receive a frame. */
    kStatus_ENET_QOS_RxFrameEmpty = MAKE_STATUS(kStatusGroup_ENET_QOS, 3U), /*!< No frame arrive. */
    kStatus_ENET_QOS_RxFrameDrop =
        MAKE_STATUS(kStatusGroup_ENET_QOS, 4U), /*!< Rx frame is dropped since no buffer memory. */
    kStatus_ENET_QOS_TxFrameBusy =
        MAKE_STATUS(kStatusGroup_ENET_QOS, 5U), /*!< Transmit descriptors are under process. */
    kStatus_ENET_QOS_TxFrameFail    = MAKE_STATUS(kStatusGroup_ENET_QOS, 6U), /*!< Transmit frame fail. */
    kStatus_ENET_QOS_TxFrameOverLen = MAKE_STATUS(kStatusGroup_ENET_QOS, 7U), /*!< Transmit oversize. */
    kStatus_ENET_QOS_Est_SwListBusy =
        MAKE_STATUS(kStatusGroup_ENET_QOS, 8U), /*!< SW Gcl List not yet processed by HW. */
    kStatus_ENET_QOS_Est_SwListWriteAbort = MAKE_STATUS(kStatusGroup_ENET_QOS, 9U), /*!< SW Gcl List write aborted .*/
    kStatus_ENET_QOS_Est_InvalidParameter =
        MAKE_STATUS(kStatusGroup_ENET_QOS, 10U),                             /*!< Invalid parameter in Gcl List .*/
    kStatus_ENET_QOS_Est_BtrError = MAKE_STATUS(kStatusGroup_ENET_QOS, 11U), /*!< Base Time Error when loading list.*/
    kStatus_ENET_QOS_TrgtBusy     = MAKE_STATUS(kStatusGroup_ENET_QOS, 12U), /*!< Target time register busy.*/
    kStatus_ENET_QOS_Timeout      = MAKE_STATUS(kStatusGroup_ENET_QOS, 13U), /*!< Target time register busy.*/
    kStatus_ENET_QOS_PpsBusy      = MAKE_STATUS(kStatusGroup_ENET_QOS, 14U)  /*!< Pps command busy.*/
};

/*! @brief Defines the MII/RGMII mode for data interface between the MAC and the PHY. */
typedef enum _enet_qos_mii_mode
{
    kENET_QOS_MiiMode   = 0U, /*!< MII mode for data interface. */
    kENET_QOS_RgmiiMode = 1U, /*!< RGMII mode for data interface. */
    kENET_QOS_RmiiMode  = 4U  /*!< RMII mode for data interface. */
} enet_qos_mii_mode_t;

/*! @brief Defines the 10/100/1000 Mbps speed for the MII data interface. */
typedef enum _enet_qos_mii_speed
{
    kENET_QOS_MiiSpeed10M =
        ENET_QOS_MAC_CONFIGURATION_PS(1U) | ENET_QOS_MAC_CONFIGURATION_FES(0U), /*!< Speed 10 Mbps. */
    kENET_QOS_MiiSpeed100M =
        ENET_QOS_MAC_CONFIGURATION_PS(1U) | ENET_QOS_MAC_CONFIGURATION_FES(1U), /*!< Speed 100 Mbps. */
    kENET_QOS_MiiSpeed1000M =
        ENET_QOS_MAC_CONFIGURATION_PS(0U) | ENET_QOS_MAC_CONFIGURATION_FES(0U), /*!< Speed 1000 Mbps. */
    kENET_QOS_MiiSpeed2500M =
        ENET_QOS_MAC_CONFIGURATION_PS(0U) | ENET_QOS_MAC_CONFIGURATION_FES(1U) /*!< Speed 2500 Mbps. */
} enet_qos_mii_speed_t;

/*! @brief Defines the half or full duplex for the MII data interface. */
typedef enum _enet_qos_mii_duplex
{
    kENET_QOS_MiiHalfDuplex = 0U, /*!< Half duplex mode. */
    kENET_QOS_MiiFullDuplex       /*!< Full duplex mode. */
} enet_qos_mii_duplex_t;

/*! @brief Define the MII opcode for normal MDIO_CLAUSES_22 Frame. */
typedef enum _enet_qos_mii_normal_opcode
{
    kENET_QOS_MiiWriteFrame =
        ENET_QOS_MAC_MDIO_ADDRESS_GOC_1(0U) |
        ENET_QOS_MAC_MDIO_ADDRESS_GOC_0(1U), /*!< Write frame operation for a valid MII management frame. */
    kENET_QOS_MiiReadFrame =
        ENET_QOS_MAC_MDIO_ADDRESS_GOC_1(1U) |
        ENET_QOS_MAC_MDIO_ADDRESS_GOC_0(1U) /*!< Read frame operation for a valid MII management frame. */
} enet_qos_mii_normal_opcode;

/*! @brief Define the DMA maximum transmit burst length. */
typedef enum _enet_qos_dma_burstlen
{
    kENET_QOS_BurstLen1   = 0x00001U, /*!< DMA burst length 1. */
    kENET_QOS_BurstLen2   = 0x00002U, /*!< DMA burst length 2. */
    kENET_QOS_BurstLen4   = 0x00004U, /*!< DMA burst length 4. */
    kENET_QOS_BurstLen8   = 0x00008U, /*!< DMA burst length 8. */
    kENET_QOS_BurstLen16  = 0x00010U, /*!< DMA burst length 16. */
    kENET_QOS_BurstLen32  = 0x00020U, /*!< DMA burst length 32. */
    kENET_QOS_BurstLen64  = 0x10008U, /*!< DMA burst length 64. eight times enabled. */
    kENET_QOS_BurstLen128 = 0x10010U, /*!< DMA burst length 128. eight times enabled. */
    kENET_QOS_BurstLen256 = 0x10020U, /*!< DMA burst length 256. eight times enabled. */
} enet_qos_dma_burstlen;

/*! @brief Define the flag for the descriptor. */
typedef enum _enet_qos_desc_flag
{
    kENET_QOS_MiddleFlag = 0, /*!< It's a middle descriptor of the frame. */
    kENET_QOS_LastFlagOnly,   /*!< It's the last descriptor of the frame. */
    kENET_QOS_FirstFlagOnly,  /*!< It's the first descriptor of the frame. */
    kENET_QOS_FirstLastFlag   /*!< It's the first and last descriptor of the frame. */
} enet_qos_desc_flag;

/*! @brief Define the system time adjust operation control. */
typedef enum _enet_qos_systime_op
{
    kENET_QOS_SystimeAdd      = 0U, /*!< System time add to. */
    kENET_QOS_SystimeSubtract = 1U  /*!< System time subtract. */
} enet_qos_systime_op;

/*! @brief Define the system time rollover control. */
typedef enum _enet_qos_ts_rollover_type
{
    kENET_QOS_BinaryRollover  = 0, /*!< System time binary rollover.*/
    kENET_QOS_DigitalRollover = 1  /*!< System time digital rollover.*/
} enet_qos_ts_rollover_type;

/*! @brief Defines some special configuration for ENET.
 *
 * These control flags are provided for special user requirements.
 * Normally, these is no need to set this control flags for ENET initialization.
 * But if you have some special requirements, set the flags to specialControl
 * in the enet_qos_config_t.
 * @note "kENET_QOS_StoreAndForward" is recommended to be set.
 */
typedef enum _enet_qos_special_config
{

    /***********************DMA CONFGI**********************************************/
    kENET_QOS_DescDoubleBuffer = 0x0001U, /*!< The double buffer is used in the tx/rx descriptor. */
    /**************************MTL************************************/
    kENET_QOS_StoreAndForward = 0x0002U, /*!< The rx/tx store and forward enable. */
    /***********************MAC****************************************/
    kENET_QOS_PromiscuousEnable   = 0x0004U, /*!< The promiscuous enabled. */
    kENET_QOS_FlowControlEnable   = 0x0008U, /*!< The flow control enabled. */
    kENET_QOS_BroadCastRxDisable  = 0x0010U, /*!< The broadcast disabled. */
    kENET_QOS_MulticastAllEnable  = 0x0020U, /*!< All multicast are passed. */
    kENET_QOS_8023AS2KPacket      = 0x0040U, /*!< 8023as support for 2K packets. */
    kENET_QOS_HashMulticastEnable = 0x0080U  /*!< The multicast packets are filtered through hash table. */
} enet_qos_special_config_t;

/*! @brief List of DMA interrupts supported by the ENET interrupt. This
 * enumeration uses one-bot encoding to allow a logical OR of multiple
 * members.
 */
typedef enum _enet_qos_dma_interrupt_enable
{
    kENET_QOS_DmaTx                = ENET_QOS_DMA_CHX_INT_EN_TIE_MASK,  /*!< Tx interrupt. */
    kENET_QOS_DmaTxStop            = ENET_QOS_DMA_CHX_INT_EN_TXSE_MASK, /*!< Tx stop interrupt. */
    kENET_QOS_DmaTxBuffUnavail     = ENET_QOS_DMA_CHX_INT_EN_TBUE_MASK, /*!< Tx buffer unavailable. */
    kENET_QOS_DmaRx                = ENET_QOS_DMA_CHX_INT_EN_RIE_MASK,  /*!< Rx interrupt. */
    kENET_QOS_DmaRxBuffUnavail     = ENET_QOS_DMA_CHX_INT_EN_RBUE_MASK, /*!< Rx buffer unavailable. */
    kENET_QOS_DmaRxStop            = ENET_QOS_DMA_CHX_INT_EN_RSE_MASK,  /*!< Rx stop. */
    kENET_QOS_DmaRxWatchdogTimeout = ENET_QOS_DMA_CHX_INT_EN_RWTE_MASK, /*!< Rx watchdog timeout. */
    kENET_QOS_DmaEarlyTx           = ENET_QOS_DMA_CHX_INT_EN_ETIE_MASK, /*!< Early transmit. */
    kENET_QOS_DmaEarlyRx           = ENET_QOS_DMA_CHX_INT_EN_ERIE_MASK, /*!< Early receive. */
    kENET_QOS_DmaBusErr            = ENET_QOS_DMA_CHX_INT_EN_FBEE_MASK, /*!< Fatal bus error. */
} enet_qos_dma_interrupt_enable_t;

