RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_enet_qos.h
/*! @brief List of mac interrupts supported by the ENET interrupt. This
 * enumeration uses one-bot encoding to allow a logical OR of multiple
 * members.
 */
typedef enum _enet_qos_mac_interrupt_enable
{
    kENET_QOS_MacPmt       = (ENET_QOS_MAC_INTERRUPT_ENABLE_PMTIE_MASK << ENET_QOS_MACINT_ENUM_OFFSET),
    kENET_QOS_MacTimestamp = (ENET_QOS_MAC_INTERRUPT_ENABLE_TSIE_MASK << ENET_QOS_MACINT_ENUM_OFFSET),
} enet_qos_mac_interrupt_enable_t;

/*! @brief Defines the common interrupt event for callback use. */
typedef enum _enet_qos_event
{
    kENET_QOS_RxIntEvent,        /*!< Receive interrupt event. */
    kENET_QOS_TxIntEvent,        /*!< Transmit interrupt event. */
    kENET_QOS_WakeUpIntEvent,    /*!< Wake up interrupt event. */
    kENET_QOS_TimeStampIntEvent, /*!< Time stamp interrupt event. */
} enet_qos_event_t;

/*! @brief Define the MTL mode for multiple queues/rings. */
typedef enum _enet_qos_queue_mode
{
    kENET_QOS_AVB_Mode = 1U, /*!< Enable queue in AVB mode. */
    kENET_QOS_DCB_Mode = 2U, /*!< Enable queue in DCB mode. */
} enet_qos_queue_mode_t;

/*! @brief Define the MTL tx scheduling algorithm for multiple queues/rings. */
typedef enum _enet_qos_mtl_multiqueue_txsche
{
    kENET_QOS_txWeightRR       = 0U, /*!< Tx weight round-robin. */
    kENET_QOS_txWeightFQ       = 1U, /*!< Tx weight fair queuing. */
    kENET_QOS_txDefictWeightRR = 2U, /*!< Tx deficit weighted round-robin. */
    kENET_QOS_txStrPrio        = 3U, /*!< Tx strict priority. */
} enet_qos_mtl_multiqueue_txsche;

/*! @brief Define the MTL rx scheduling algorithm for multiple queues/rings. */
typedef enum _enet_qos_mtl_multiqueue_rxsche
{
    kENET_QOS_rxStrPrio = 0U,  /*!< Rx strict priority, Queue 0 has the lowest priority. */
    kENET_QOS_rxWeightStrPrio, /*!< Weighted Strict Priority. */
} enet_qos_mtl_multiqueue_rxsche;

/*! @brief Define the MTL rx queue and DMA channel mapping. */
typedef enum _enet_qos_mtl_rxqueuemap
{
    kENET_QOS_StaticDirctMap = 0x100U, /*!< The received fame in rx Qn(n = 0,1) directly map to dma channel n. */
    kENET_QOS_DynamicMap =
        0x1010U, /*!< The received frame in rx Qn(n = 0,1) map to the dma channel m(m = 0,1) related with the same Mac.
                  */
} enet_qos_mtl_rxqueuemap_t;

/*! @brief Defines the package type for receive queue routing. */
typedef enum _enet_qos_rx_queue_route
{
    kENET_QOS_PacketNoQ    = 0x0,        /* Not specific queue */
    kENET_QOS_PacketAVCPQ  = (1U << 0U), /* AV Untagged Control Packets Queue */
    kENET_QOS_PacketPTPQ   = (1U << 1U), /* PTP Packets Queue */
    kENET_QOS_PacketDCBCPQ = (1U << 2U), /* DCB Control Packets Queue */
    kENET_QOS_PacketUPQ    = (1U << 3U), /* Untagged Packets Queue */
    kENET_QOS_PacketMCBCQ  = (1U << 4U), /* Multicast & Broadcast Packets Queue */
} enet_qos_rx_queue_route_t;

/*! @brief Defines the ENET PTP message related constant. */
typedef enum _enet_qos_ptp_event_type
{
    kENET_QOS_PtpEventMsgType = 3U,   /*!< PTP event message type. */
    kENET_QOS_PtpSrcPortIdLen = 10U,  /*!< PTP message sequence id length. */
    kENET_QOS_PtpEventPort    = 319U, /*!< PTP event port number. */
    kENET_QOS_PtpGnrlPort     = 320U  /*!< PTP general port number. */
} enet_qos_ptp_event_type_t;

/*! @brief Defines the PPS instance numbers. */
typedef enum _enet_qos_ptp_pps_instance
{
    kENET_QOS_PtpPpsIstance0 = 0U, /*!< PPS instance 0. */
    kENET_QOS_PtpPpsIstance1,      /*!< PPS instance 1. */
    kENET_QOS_PtpPpsIstance2,      /*!< PPS instance 2. */
    kENET_QOS_PtpPpsIstance3       /*!< PPS instance 3. */
} enet_qos_ptp_pps_instance_t;

/*! @brief Defines the Target Time register mode. */
typedef enum _enet_qos_ptp_pps_trgt_mode
{
    kENET_QOS_PtpPpsTrgtModeOnlyInt = 0U, /*!< Only interrupts. */
    kENET_QOS_PtpPpsTrgtModeIntSt   = 2,  /*!< Both interrupt and output signal. */
    kENET_QOS_PtpPpsTrgtModeOnlySt  = 3,  /*!< Only output signal. */
} enet_qos_ptp_pps_trgt_mode_t;

/*! @brief Defines commands for ppscmd register. */
typedef enum _enet_qos_ptp_pps_cmd
{
    kENET_QOS_PtpPpsCmdNC    = 0U, /*!< No Command. */
    kENET_QOS_PtpPpsCmdSSP   = 1U, /*!< Start Single Pulse. */
    kENET_QOS_PtpPpsCmdSPT   = 2U, /*!< Start Pulse Train. */
    kENET_QOS_PtpPpsCmdCS    = 3U, /*!< Cancel Start. */
    kENET_QOS_PtpPpsCmdSPTAT = 4U, /*!< Stop Pulse Train At Time. */
    kENET_QOS_PtpPpsCmdSPTI  = 5U, /*!< Stop Pulse Train Immediately. */
    kENET_QOS_PtpPpsCmdCSPT  = 6U, /*!< Cancel Stop Pulse Train. */
} enet_qos_ptp_pps_cmd_t;

/*! @brief Defines the enmueration of ETS list length.
 */
typedef enum _enet_qos_ets_list_length
{
    kENET_QOS_Ets_List_64   = 7U,  /*!< List length of 64 */
    kENET_QOS_Ets_List_128  = 8U,  /*!< List length of 128 */
    kENET_QOS_Ets_List_256  = 9U,  /*!< List length of 256 */
    kENET_QOS_Ets_List_512  = 10U, /*!< List length of 512 */
    kENET_QOS_Ets_List_1024 = 11U, /*!< List length of 1024 */
} enet_qos_ets_list_length_t;

/*! @brief Defines the enmueration of ETS gate control address.
 */
typedef enum _enet_qos_ets_gccr_addr
{
    kENET_QOS_Ets_btr_low  = 0U, /*!< BTR Low */
    kENET_QOS_Ets_btr_high = 1U, /*!< BTR High */
    kENET_QOS_Ets_ctr_low  = 2U, /*!< CTR Low */
    kENET_QOS_Ets_ctr_high = 3U, /*!< CTR High */
    kENET_QOS_Ets_ter      = 4U, /*!< TER */
    kENET_QOS_Ets_llr      = 5U, /*!< LLR */
} enet_qos_ets_gccr_addr_t;

/*! @brief Defines the enmueration of DMA channel used
 * for rx parser entry.
 */
typedef enum _enet_qos_rxp_dma_chn
{
    kENET_QOS_Rxp_DMAChn0 = 1U,  /*!< DMA Channel 0 used for RXP entry match */
    kENET_QOS_Rxp_DMAChn1 = 2U,  /*!< DMA Channel 1 used for RXP entry match */
    kENET_QOS_Rxp_DMAChn2 = 4U,  /*!< DMA Channel 2 used for RXP entry match */
    kENET_QOS_Rxp_DMAChn3 = 8U,  /*!< DMA Channel 3 used for RXP entry match */
    kENET_QOS_Rxp_DMAChn4 = 16U, /*!< DMA Channel 4 used for RXP entry match */
} enet_qos_rxp_dma_chn_t;

/*! @brief Defines the receive descriptor structure
 *  has the read-format and write-back format structure. They both
 *  has the same size with different region definition. so
 *  we define the read-format region as the receive descriptor structure
 *  Use the read-format region mask bits in the descriptor initialization
 *  Use the write-back format region mask bits in the receive data process.
 */
typedef struct _enet_qos_rx_bd_struct
{
    __IO uint32_t buff1Addr; /*!< Buffer 1 address */
    __IO uint32_t reserved;  /*!< Reserved */
    __IO uint32_t buff2Addr; /*!< Buffer 2 or next descriptor address */
    __IO uint32_t control;   /*!< Buffer 1/2 byte counts and control */
} enet_qos_rx_bd_struct_t;

/*! @brief Defines the transmit descriptor structure
 *  has the read-format and write-back format structure. They both
 *  has the same size with different region definition. so
 *  we define the read-format region as the transmit descriptor structure
 *  Use the read-format region mask bits in the descriptor initialization
 *  Use the write-back format region mask bits in the transmit data process.
 */
typedef struct _enet_qos_tx_bd_struct
{
    __IO uint32_t buff1Addr;   /*!< Buffer 1 address */
    __IO uint32_t buff2Addr;   /*!< Buffer 2 address */
    __IO uint32_t buffLen;     /*!< Buffer 1/2 byte counts */
    __IO uint32_t controlStat; /*!< TDES control and status word */
} enet_qos_tx_bd_struct_t;

/*! @brief Defines the ENET PTP time stamp structure. */
typedef struct _enet_qos_ptp_time
{
    uint64_t second;     /*!< Second. */
    uint32_t nanosecond; /*!< Nanosecond. */
} enet_qos_ptp_time_t;

/*! @brief Defines the frame info structure. */
typedef struct enet_qos_frame_info
{
    void *context;                 /*!< User specified data, could be buffer address for free */
    bool isTsAvail;                /*!< Flag indicates timestamp available status */
    enet_qos_ptp_time_t timeStamp; /*!< Timestamp of frame */
} enet_qos_frame_info_t;

/*! @brief Defines the ENET transmit dirty addresses ring/queue structure. */
typedef struct _enet_qos_tx_dirty_ring
{
    enet_qos_frame_info_t *txDirtyBase; /*!< Dirty buffer descriptor base address pointer. */
    uint16_t txGenIdx;                  /*!< tx generate index. */
    uint16_t txConsumIdx;               /*!< tx consume index. */
    uint16_t txRingLen;                 /*!< tx ring length. */
    bool isFull;                        /*!< tx ring is full flag, add this parameter to avoid waste one element. */
} enet_qos_tx_dirty_ring_t;

/*! @brief Defines the ENET PTP configuration structure. */
typedef struct _enet_qos_ptp_config
{
    bool fineUpdateEnable;       /*!< Use the fine update. */
    uint32_t defaultAddend;      /*!< Default addend value when fine update is enable, could be 2^32 / (refClk_Hz /
                                    ENET_QOS_MICRSECS_ONESECOND / ENET_QOS_SYSTIME_REQUIRED_CLK_MHZ). */
    uint32_t systemTimeClock_Hz; /*! The desired system time frequency. Must be lower than reference clock. (Only used
                                    with fine correction method). */
    bool ptp1588V2Enable;        /*!< ptp 1588 version 2 is used. */
    enet_qos_ts_rollover_type tsRollover; /*!< 1588 time nanosecond rollover. */
} enet_qos_ptp_config_t;

/*! @brief Defines the EST gate operation structure. */
typedef struct _enet_qos_est_gate_op
{
    uint32_t gate;
    uint32_t interval;
} enet_qos_est_gate_op_t;

/*! @brief Defines the EST gate control list structure. */
typedef struct _enet_qos_est_gcl
{
    bool enable;                    /*!< Enable or disable EST */
    uint64_t baseTime;              /*! Base Time 32 bits seconds 32 bits nanoseconds */
    uint64_t cycleTime;             /*! Cycle Time 32 bits seconds 32 bits nanoseconds */
    uint32_t extTime;               /*! Time Extension 32 bits seconds 32 bits nanoseconds */
    uint32_t numEntries;            /*! Number of entries */
    enet_qos_est_gate_op_t *opList; /*! Pointer to GCL list size */
} enet_qos_est_gcl_t;

/*! @brief Defines the ENET_QOS Rx parser configuration structure.*/
typedef struct _enet_qos_rxp_config
{
    uint32_t matchData;       /*! 4-byte match data used for comparing with incoming packet */
    uint32_t matchEnable;     /*! When matchEnable is set to 1, the matchData is used for comparing */
    uint8_t acceptFrame : 1;  /*! When acceptFrame = 1 and data is matched, the frame will be sent to DMA channel */
    uint8_t rejectFrame : 1;  /*! When rejectFrame = 1 and data is matched, the frame will be dropped */
    uint8_t inverseMatch : 1; /*! Inverse match */
    uint8_t nextControl : 1;  /*! Next instruction indexing control */
    uint8_t reserved : 4;     /*! Reserved control fields */
    uint8_t frameOffset;      /*! Frame offset in the packet data to be compared for match, in terms of 4 bytes. */
    uint8_t okIndex;          /*! Memory Index to be used next. */
    uint8_t dmaChannel; /*! The DMA channel enet_qos_rxp_dma_chn_t used for receiving the frame when frame match and
                           acceptFrame = 1 */
    uint32_t reserved2; /*! Reserved for future enhancements */
} enet_qos_rxp_config_t;

/*! @brief Defines the buffer descriptor configure structure.
 *
 * @note
 * 1. The receive and transmit descriptor start address pointer and tail pointer must be word-aligned.
 * 2. The recommended minimum tx/rx ring length is 4.
 * 3. The tx/rx descriptor tail address shall be the address pointer to the address just after the end
 *    of the last last descriptor. because only the descriptors between the start address and the
 *    tail address will be used by DMA.
 * 4. The descriptor address is the start address of all used contiguous memory.
 *    for example, the rxDescStartAddrAlign is the start address of rxRingLen contiguous descriptor memories
 *    for rx descriptor ring 0.
 * 5. The "*rxBufferstartAddr" is the first element of  rxRingLen (2*rxRingLen for double buffers)
 *    rx buffers. It means the *rxBufferStartAddr is the rx buffer for the first descriptor
 *    the *rxBufferStartAddr + 1 is the rx buffer for the second descriptor or the rx buffer for
 *    the second buffer in the first descriptor. so please make sure the rxBufferStartAddr is the
 *    address of a rxRingLen or 2*rxRingLen array.
 */
typedef struct _enet_qos_buffer_config
{
    uint8_t rxRingLen;                             /*!< The length of receive buffer descriptor ring. */
    uint8_t txRingLen;                             /*!< The length of transmit buffer descriptor ring. */
    enet_qos_tx_bd_struct_t *txDescStartAddrAlign; /*!< Aligned transmit descriptor start address. */
    enet_qos_tx_bd_struct_t *txDescTailAddrAlign;  /*!< Aligned transmit descriptor tail address. */
    enet_qos_frame_info_t *txDirtyStartAddr;       /*!< Start address of the dirty tx frame information. */
    enet_qos_rx_bd_struct_t *rxDescStartAddrAlign; /*!< Aligned receive descriptor start address. */
    enet_qos_rx_bd_struct_t *rxDescTailAddrAlign;  /*!< Aligned receive descriptor tail address. */
    uint32_t *rxBufferStartAddr;                   /*!< Start address of the rx buffers. */
    uint32_t rxBuffSizeAlign;                      /*!< Aligned receive data buffer size. */
    bool rxBuffNeedMaintain;                       /*!< Whether receive data buffer need cache maintain. */
} enet_qos_buffer_config_t;

