RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_enet_qos.h
/*! @brief Defines the CBS configuration for queue. */
typedef struct _enet_qos_cbs_config
{
    uint16_t sendSlope;  /*!< Send slope configuration. */
    uint16_t idleSlope;  /*!< Idle slope configuration. */
    uint32_t highCredit; /*!< High credit. */
    uint32_t lowCredit;  /*!< Low credit. */
} enet_qos_cbs_config_t;

/*! @brief Defines the queue configuration structure. */
typedef struct enet_qos_tx_queue_config
{
    enet_qos_queue_mode_t mode;       /*!< tx queue mode configuration. */
    uint32_t weight;                  /*!< Refer to the MTL TxQ Quantum Weight register. */
    uint32_t priority;                /*!< Refer to Transmit Queue Priority Mapping register. */
    enet_qos_cbs_config_t *cbsConfig; /*!< CBS configuration if queue use AVB mode. */
} enet_qos_queue_tx_config_t;

/*! @brief Defines the queue configuration structure. */
typedef struct enet_qos_rx_queue_config
{
    enet_qos_queue_mode_t mode;            /*!< rx queue mode configuration. */
    uint8_t mapChannel;                    /*!< tx queue map dma channel. */
    uint32_t priority;                     /*!< Rx queue priority. */
    enet_qos_rx_queue_route_t packetRoute; /*!< Receive packet routing. */
} enet_qos_queue_rx_config_t;

/*! @brief Defines the configuration when multi-queue is used. */
typedef struct enet_qos_multiqueue_config
{
    enet_qos_dma_burstlen burstLen;                                  /*!< Burst len for the multi-queue. */
    uint8_t txQueueUse;                                              /*!< Used Tx queue count. */
    enet_qos_mtl_multiqueue_txsche mtltxSche;                        /*!< Transmit schedule for multi-queue. */
    enet_qos_queue_tx_config_t txQueueConfig[ENET_QOS_RING_NUM_MAX]; /*!< Tx Queue configuration. */
    uint8_t rxQueueUse;                                              /*!< Used Rx queue count. */
    enet_qos_mtl_multiqueue_rxsche mtlrxSche;                        /*!< Receive schedule for multi-queue. */
    enet_qos_queue_rx_config_t rxQueueConfig[ENET_QOS_RING_NUM_MAX]; /*!< Rx Queue configuration. */
} enet_qos_multiqueue_config_t;

/*! @brief Defines the Rx memory buffer alloc function pointer. */
typedef void *(*enet_qos_rx_alloc_callback_t)(ENET_QOS_Type *base, void *userData, uint8_t channel);

/*! @brief Defines the Rx memory buffer free function pointer. */
typedef void (*enet_qos_rx_free_callback_t)(ENET_QOS_Type *base, void *buffer, void *userData, uint8_t channel);

/*! @brief Defines the basic configuration structure for the ENET device.
 *
 *  @note Default the signal queue is used so the "*multiqueueCfg" is set default
 *  with NULL. Set the pointer with a valid configuration pointer if the multiple
 *  queues are required. If multiple queue is enabled, please make sure the
 *  buffer configuration for all are prepared also.
 */
typedef struct _enet_qos_config
{
    uint16_t specialControl;                     /*!< The logic or of enet_qos_special_config_t */
    enet_qos_multiqueue_config_t *multiqueueCfg; /*!< Use multi-queue. */
    /* -----------------MAC block-------------------------------*/
    enet_qos_mii_mode_t miiMode;     /*!< MII mode. */
    enet_qos_mii_speed_t miiSpeed;   /*!< MII Speed. */
    enet_qos_mii_duplex_t miiDuplex; /*!< MII duplex. */
    uint16_t
        pauseDuration; /*!< Used in the tx flow control frame, only valid when kENET_QOS_FlowControlEnable is set. */
                       /* -----------------Timestamp -------------------------------*/
    enet_qos_ptp_config_t *ptpConfig;         /*!< PTP 1588 feature configuration */
    uint32_t csrClock_Hz;                     /*!< CSR clock frequency in HZ. */
    enet_qos_rx_alloc_callback_t rxBuffAlloc; /*!< Callback to alloc memory, must be provided for zero-copy Rx. */
    enet_qos_rx_free_callback_t rxBuffFree;   /*!< Callback to free memory, must be provided for zero-copy Rx. */
} enet_qos_config_t;

/* Forward declaration of the handle typedef. */
typedef struct _enet_qos_handle enet_qos_handle_t;

/*! @brief ENET callback function. */
typedef void (*enet_qos_callback_t)(
    ENET_QOS_Type *base, enet_qos_handle_t *handle, enet_qos_event_t event, uint8_t channel, void *userData);

/*! @brief Defines the ENET transmit buffer descriptor ring/queue structure. */
typedef struct _enet_qos_tx_bd_ring
{
    enet_qos_tx_bd_struct_t *txBdBase; /*!< Buffer descriptor base address pointer. */
    uint16_t txGenIdx;                 /*!< tx generate index. */
    uint16_t txConsumIdx;              /*!< tx consume index. */
    volatile uint16_t txDescUsed;      /*!< tx descriptor used number. */
    uint16_t txRingLen;                /*!< tx ring length. */
} enet_qos_tx_bd_ring_t;

/*! @brief Defines the ENET receive buffer descriptor ring/queue structure. */
typedef struct _enet_qos_rx_bd_ring
{
    enet_qos_rx_bd_struct_t *rxBdBase; /*!< Buffer descriptor base address pointer. */
    uint16_t rxGenIdx;                 /*!< The current available receive buffer descriptor pointer. */
    uint16_t rxRingLen;                /*!< Receive ring length. */
    uint32_t rxBuffSizeAlign;          /*!< Receive buffer size. */
} enet_qos_rx_bd_ring_t;

/*! @brief Defines the ENET handler structure. */
struct _enet_qos_handle
{
    uint8_t txQueueUse;                                          /*!< Used tx queue count. */
    uint8_t rxQueueUse;                                          /*!< Used rx queue count. */
    bool doubleBuffEnable;                                       /*!< The double buffer is used in the descriptor. */
    bool rxintEnable;                                            /*!< Rx interrupt enabled. */
    bool rxMaintainEnable[ENET_QOS_RING_NUM_MAX];                /*!< Rx buffer cache maintain enabled. */
    enet_qos_rx_bd_ring_t rxBdRing[ENET_QOS_RING_NUM_MAX];       /*!< Receive buffer descriptor.  */
    enet_qos_tx_bd_ring_t txBdRing[ENET_QOS_RING_NUM_MAX];       /*!< Transmit buffer descriptor.  */
    enet_qos_tx_dirty_ring_t txDirtyRing[ENET_QOS_RING_NUM_MAX]; /*!< Transmit dirty buffers addresses.  */
    uint32_t *rxBufferStartAddr[ENET_QOS_RING_NUM_MAX];          /*!< Rx buffer start address for reInitialize. */
    enet_qos_callback_t callback;                                /*!< Callback function. */
    void *userData;                                              /*!< Callback function parameter.*/
    uint8_t multicastCount[64];                                  /*!< Multicast collisions counter */
    enet_qos_rx_alloc_callback_t rxBuffAlloc; /*!< Callback to alloc memory, must be provided for zero-copy Rx. */
    enet_qos_rx_free_callback_t rxBuffFree;   /*!< Callback to free memory, must be provided for zero-copy Rx. */
};

