RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_enet_qos.h
/*!
 * @brief Correct the ENET PTP 1588 timer in coarse method.
 *
 * @param base  ENET peripheral base address.
 * @param operation The system time operation, refer to "enet_qos_systime_op"
 * @param second The correction second.
 * @param nanosecond The correction nanosecond.
 */
status_t ENET_QOS_Ptp1588CorrectTimerInCoarse(ENET_QOS_Type *base,
                                              enet_qos_systime_op operation,
                                              uint32_t second,
                                              uint32_t nanosecond);

/*!
 * @brief Correct the ENET PTP 1588 timer in fine method.
 *
 *
 * @param base  ENET peripheral base address.
 * @param addend The addend value to be set in the fine method
 * @note Should take refer to the chapter "System time correction" and
 * see the description for the "fine correction method".
 */
status_t ENET_QOS_Ptp1588CorrectTimerInFine(ENET_QOS_Type *base, uint32_t addend);

/*!
 * @brief Get the ENET Time stamp current addend value.
 *
 * @param base  ENET peripheral base address.
 * @return The addend value.
 */
static inline uint32_t ENET_QOS_Ptp1588GetAddend(ENET_QOS_Type *base)
{
    return base->MAC_TIMESTAMP_ADDEND;
}

/*!
 * @brief Gets the current ENET time from the PTP 1588 timer without IRQ disable.
 *
 * @param base  ENET peripheral base address.
 * @param second The PTP 1588 system timer second.
 * @param nanosecond The PTP 1588 system timer nanosecond.
 * For the unit of the nanosecond is 1ns. so the nanosecond is the real nanosecond.
 */
void ENET_QOS_Ptp1588GetTimerNoIRQDisable(ENET_QOS_Type *base, uint64_t *second, uint32_t *nanosecond);

/*!
 * @brief Sets the ENET PTP 1588 PPS control.
 * All channels operate in flexible PPS output mode.
 *
 * @param base  ENET peripheral base address.
 * @param instance The ENET QOS PTP PPS instance.
 * @param trgtMode The target time register mode.
 * @param cmd The target flexible PPS output control command.
 */
static inline status_t ENET_Ptp1588PpsControl(ENET_QOS_Type *base,
                                              enet_qos_ptp_pps_instance_t instance,
                                              enet_qos_ptp_pps_trgt_mode_t trgtMode,
                                              enet_qos_ptp_pps_cmd_t cmd)
{
    uint32_t reg        = 0UL;
    uint8_t shift       = (uint8_t)instance * 8U;
    uint32_t pps_config = ENET_QOS_MAC_PPS_CONTROL_TRGTMODSEL0((uint32_t)trgtMode) |
                          ENET_QOS_MAC_PPS_CONTROL_PPSCTRL_PPSCMD((uint32_t)cmd);

    reg = base->MAC_PPS_CONTROL;

    /* Make sure CMD field is all zero */
    if ((reg & (0xFUL << shift)) != 0UL)
    {
        return kStatus_ENET_QOS_PpsBusy;
    }

    reg &= ~(0xFFUL << shift);
    reg |= (pps_config << shift) | ENET_QOS_MAC_PPS_CONTROL_PPSEN0(1U);

    base->MAC_PPS_CONTROL = reg;

    return kStatus_Success;
}

/*!
 * @brief Sets the ENET OQS PTP 1588 PPS target time registers.
 *
 * @param base  ENET QOS peripheral base address.
 * @param instance The ENET QOS PTP PPS instance.
 * @param seconds The target seconds.
 * @param nanoseconds The target nanoseconds.
 */
status_t ENET_QOS_Ptp1588PpsSetTrgtTime(ENET_QOS_Type *base,
                                        enet_qos_ptp_pps_instance_t instance,
                                        uint32_t seconds,
                                        uint32_t nanoseconds);

/*!
 * @brief Sets the ENET OQS PTP 1588 PPS output signal interval
 *
 * @param base  ENET QOS peripheral base address.
 * @param instance The ENET QOS PTP PPS instance.
 * @param width Signal Width. It is stored in terms of number of
 * units of sub-second increment value. The width value must be
 * lesser than interval value.
 */
static inline void ENET_QOS_Ptp1588PpsSetWidth(ENET_QOS_Type *base,
                                               enet_qos_ptp_pps_instance_t instance,
                                               uint32_t width)
{
    uint32_t *mac_pps_width;

    mac_pps_width = (uint32_t *)((uintptr_t)&base->MAC_PPS0_WIDTH + 0x10U * (uint32_t)instance);

    *mac_pps_width = ENET_QOS_MAC_PPS0_WIDTH_PPSWIDTH0(width);
}

/*!
 * @brief Sets the ENET OQS PTP 1588 PPS output signal width
 *
 * @param base  ENET QOS peripheral base address.
 * @param instance The ENET QOS PTP PPS instance.
 * @param interval Signal Interval. It is stored in terms of number of
 * units of sub-second increment value.
 */
static inline void ENET_QOS_Ptp1588PpsSetInterval(ENET_QOS_Type *base,
                                                  enet_qos_ptp_pps_instance_t instance,
                                                  uint32_t interval)
{
    uint32_t *mac_pps_interval;

    mac_pps_interval = (uint32_t *)((uintptr_t)&base->MAC_PPS0_INTERVAL + 0x10U * (uint32_t)instance);

    *mac_pps_interval = ENET_QOS_MAC_PPS0_INTERVAL_PPSINT0(interval);
}

/*!
 * @brief Gets the current ENET time from the PTP 1588 timer.
 *
 * @param base  ENET peripheral base address.
 * @param second The PTP 1588 system timer second.
 * @param nanosecond The PTP 1588 system timer nanosecond.
 * For the unit of the nanosecond is 1ns.so the nanosecond is the real nanosecond.
 */
void ENET_QOS_Ptp1588GetTimer(ENET_QOS_Type *base, uint64_t *second, uint32_t *nanosecond);

/*!
 * @brief Gets the time stamp of the transmit frame.
 *
 * This function is used for PTP stack to get the timestamp captured by the ENET driver.
 *
 * @param handle The ENET handler pointer.This is the same state pointer used in
 *        ENET_QOS_Init.
 * @param txFrame Input parameter, pointer to @ref enet_qos_frame_info_t for saving read out frame information.
 * @param channel Channel for searching the tx frame.
 */
void ENET_QOS_GetTxFrame(enet_qos_handle_t *handle, enet_qos_frame_info_t *txFrame, uint8_t channel);

/*!
 * @brief Receives one frame in specified BD ring with zero copy.
 *
 * This function will use the user-defined allocate and free callback. Every time application gets one frame through
 * this function, driver will allocate new buffers for the BDs whose buffers have been taken by application.
 * @note This function will drop current frame and update related BDs as available for DMA if new buffers allocating
 * fails. Application must provide a memory pool including at least BD number + 1 buffers(+2 if enable double buffer)
 * to make this function work normally. If user calls this function in Rx interrupt handler, be careful that this
 * function makes Rx BD ready with allocating new buffer(normal) or updating current BD(out of memory). If there's
 * always new Rx frame input, Rx interrupt will be triggered forever. Application need to disable Rx interrupt according
 * to specific design in this case.
 *
 * @param base   ENET peripheral base address.
 * @param handle The ENET handler pointer. This is the same handler pointer used in the ENET_Init.
 * @param rxFrame The received frame information structure provided by user.
 * @param channel Channel for searching the rx frame.
 * @retval kStatus_Success  Succeed to get one frame and allocate new memory for Rx buffer.
 * @retval kStatus_ENET_QOS_RxFrameEmpty  There's no Rx frame in the BD.
 * @retval kStatus_ENET_QOS_RxFrameError  There's issue in this receiving.
 * @retval kStatus_ENET_QOS_RxFrameDrop  There's no new buffer memory for BD, drop this frame.
 */
status_t ENET_QOS_GetRxFrame(ENET_QOS_Type *base,
                             enet_qos_handle_t *handle,
                             enet_qos_rx_frame_struct_t *rxFrame,
                             uint8_t channel);

/* @} */

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* _FSL_ENET_QOS_H_ */
